const articles = [
  {
    slug: "mocha",
    title: "موکاچینو",
    description:
      "موکاچینو ترکیبی از قهوه اسپرسو، شکلات و شیر بخار داده شده است که طعمی شگفت‌انگیز دارد.",
    image: "/images/blogs/mocha.jpg",
    date: "24 دی",
    author: "pedram_z4",
    authorImage: "/images/unknown.jpg",
    content: `
    <p>موکاچینو یکی از محبوب‌ترین نوشیدنی‌های قهوه است که در آن طعم تلخ اسپرسو با شیر خامه‌ای و شکلات شیرین ترکیب می‌شود. این نوشیدنی ابتدا در ایتالیا برای کسانی که به طعم شکلات علاقه‌مند بودند، توسعه یافت.</p> <p>نام "موکا" از شهری در یمن به نام موکا گرفته شده است که یکی از مراکز قدیمی تولید قهوه بوده است. این نام به نوعی اشاره به تاریخچه طولانی قهوه دارد.</p> <p>در تولید موکاچینو از اسپرسو و شکلات ذوب‌شده استفاده می‌شود که باعث ایجاد طعمی غنی و پیچیده می‌شود. شیر بخار داده شده نیز به نرمی این طعم‌ها کمک می‌کند و آن را به یک نوشیدنی دلپذیر تبدیل می‌کند.</p> <p>ترکیب این طعم‌ها باعث شده است که موکاچینو هم برای کسانی که عاشق قهوه‌اند و هم برای کسانی که به طعم شیرین علاقه دارند، جذاب باشد.</p> <p>این نوشیدنی را می‌توان با افزودن خامه یا شربت شکلاتی بیشتر کرد تا طعمی غنی‌تر و شیرین‌تر پیدا کند. بسیاری از کافی‌شاپ‌ها این نوشیدنی را در انواع مختلف به مشتریان خود ارائه می‌دهند.</p> <p>موکاچینو علاوه بر طعم خوشمزه، دارای خواص مفیدی نیز است. کافئین موجود در آن می‌تواند سطح هوشیاری را افزایش دهد و به فرد کمک کند تا انرژی بیشتری داشته باشد.</p> <p>این نوشیدنی به دلیل وجود شکلات، حاوی آنتی‌اکسیدان‌هایی است که به حفظ سلامت قلب و عروق کمک می‌کنند. همچنین مصرف شکلات تلخ می‌تواند اثرات مثبتی بر حافظه و خلق‌وخو داشته باشد.</p> <p>در بسیاری از فرهنگ‌ها، موکاچینو به عنوان یک نوشیدنی لوکس و جذاب شناخته می‌شود که برای مهمانی‌ها یا جشن‌ها استفاده می‌شود.</p> <p>این نوشیدنی به دلیل داشتن طعم متعادل و خوشمزه‌اش، حتی برای کسانی که به قهوه علاقه ندارند نیز جذاب است. در حقیقت، برخی افراد به دلیل طعم شیرین و شکلاتی آن به سراغ این نوشیدنی می‌روند.</p> <p>در نهایت، موکاچینو یک نوشیدنی شیک و لذت‌بخش است که برای هر کسی که به دنبال تجربه‌ای خاص از قهوه است، یک انتخاب عالی محسوب می‌شود.</p>
    `,
  },
  {
    slug: "icecoffee",
    title: "آیس کافی",
    description:
      "آیس کافی یک نوشیدنی خنک و انرژی‌زا است که ترکیب قهوه سرد و یخ به همراه طعمی متفاوت دارد.",
    image: "/images/blogs/ice.jpg",
    date: "17 آذر",
    author: "sara_k7",
    authorImage: "/images/unknown.jpg",
    content: `
      <p>آیس کافی یکی از نوشیدنی‌های پرطرفدار در فصول گرم سال است که طرفداران زیادی در سراسر جهان دارد. این نوشیدنی از ترکیب قهوه سرد و یخ تشکیل شده است که طعمی تازه و انرژی‌بخش به ارمغان می‌آورد.</p> <p>آیس کافی با استفاده از قهوه دم کرده سرد یا یخ‌زده تهیه می‌شود. این نوشیدنی معمولاً به دلیل خنک بودنش در تابستان بسیار محبوب است. همچنین، برای کسانی که می‌خواهند لذت قهوه را در فصول گرم تجربه کنند، گزینه‌ای عالی به شمار می‌آید.</p> <p>در آیس کافی می‌توان از شیر، خامه یا حتی شربت طعم‌دهنده استفاده کرد. این مواد افزودنی باعث می‌شوند تا طعم نوشیدنی دلپذیرتر و نرم‌تر شود. همچنین، شکر یا شربت‌های گیاهی می‌توانند شیرینی نوشیدنی را تنظیم کنند.</p> <p>در برخی نسخه‌ها، آیس کافی به همراه شکر، وانیل یا طعم‌دهنده‌های دیگری مانند شکلات سرو می‌شود که به طعم این نوشیدنی بعد جدیدی می‌بخشد.</p> <p>یکی از نکات جالب در مورد آیس کافی این است که می‌توان آن را با طعم‌های مختلف از جمله شکلات، کارامل یا دارچین تجربه کرد. این تنوع باعث می‌شود که افراد بتوانند آیس کافی را مطابق با سلیقه خود شخصی‌سازی کنند.</p> <p>این نوشیدنی نه تنها به دلیل خنک بودن در تابستان محبوب است، بلکه به دلیل کافئین موجود در آن، می‌تواند به افزایش انرژی و تمرکز کمک کند. بسیاری از مردم از آیس کافی به عنوان یک نوشیدنی انگیزشی برای شروع روز استفاده می‌کنند.</p> <p>آیس کافی به دلیل طعم خاصش، به یک نوشیدنی متفاوت و هیجان‌انگیز تبدیل شده است. همچنین، به عنوان یک گزینه تازه و خنک در کنار غذای روزمره، می‌تواند لذت‌بخش باشد.</p> <p>از آنجایی که آیس کافی را می‌توان با روش‌های مختلفی آماده کرد، از جمله به صورت یخ‌زده یا با افزودن طعم‌دهنده‌های طبیعی، می‌توان این نوشیدنی را به راحتی مطابق با ذائقه شخصی تغییر داد.</p> <p>در نهایت، آیس کافی یک نوشیدنی شاداب و لذت‌بخش است که هم برای فصل‌های گرم و هم برای مواقعی که نیاز به یک نوشیدنی انرژی‌زا دارید، یک انتخاب ایده‌آل به حساب می‌آید.</p>
    `,
  },
  {
    slug: "turkishcoffee",
    title: "قهوه ترک",
    description:
      "قهوه ترک یک نوشیدنی غلیظ و شیرین است که با روش خاصی از آسیاب قهوه و جوشاندن آن در آب تهیه می‌شود.",
    image: "/images/blogs/turkish.jpg",
    date: "3 بهمن",
    author: "esi_pider",
    authorImage: "/images/unknown.jpg",
    content: `
        <p>قهوه ترک یکی از نوشیدنی‌های سنتی و معروف در کشورهای خاورمیانه است که برای تهیه آن از آسیاب بسیار ریز قهوه و آب استفاده می‌شود. این قهوه به دلیل طعم غلیظ و ترکیب خاص آن، محبوبیت زیادی در بسیاری از فرهنگ‌ها دارد.</p> <p>روش تهیه قهوه ترک شامل استفاده از یک ظرف خاص به نام "جذوه" (Cezve) است که در آن قهوه، آب و شکر (اختیاری) به همراه هم جوشانده می‌شوند. این روش به قهوه اجازه می‌دهد تا طعمی غنی و کرمی پیدا کند.</p> <p>قهوه ترک برخلاف بیشتر قهوه‌ها، فیلتر نمی‌شود و به همین دلیل دارای دانه‌های ریز قهوه در ته فنجان است. این دانه‌ها به قهوه طعمی خاص می‌بخشند که باعث می‌شود آن را از دیگر انواع قهوه‌ها متمایز کند.</p> <p>قهوه ترک معمولاً با مقدار کمی شکر تهیه می‌شود، اما در بعضی نسخه‌ها آن را بدون شکر نیز می‌سازند. این نوشیدنی به صورت کاملاً غلیظ سرو می‌شود و می‌توان آن را به عنوان یک نوشیدنی پس از غذا برای لذت بیشتر مصرف کرد.</p> <p>یکی از ویژگی‌های جالب قهوه ترک این است که در فرآیند تهیه آن، هیچ گونه فیلتر یا صافی استفاده نمی‌شود. به همین دلیل، بسیاری از افرادی که قهوه را به صورت غلیظ می‌پسندند، قهوه ترک را گزینه‌ای ایده‌آل می‌دانند.</p> <p>این قهوه به دلیل غلظت بالای خود، معمولاً به طور کم‌تر نسبت به دیگر انواع قهوه نوشیده می‌شود. اما به دلیل طعم خاص و قدرت کافئین بالا، بسیار محبوب است.</p> <p>در برخی از نسخه‌ها، قهوه ترک به همراه هل یا ادویه‌های دیگری مانند دارچین نیز سرو می‌شود که به آن طعمی متفاوت و جذاب می‌بخشد. این ویژگی باعث می‌شود قهوه ترک یک نوشیدنی خاص و متفاوت از سایر انواع قهوه‌ها باشد.</p> <p>قهوه ترک به طور معمول در فنجان‌های کوچک سرو می‌شود. به دلیل غلظت و طعم شدید آن، معمولاً نوشیدن آن نیاز به زمان بیشتری دارد و به نوعی می‌توان آن را به عنوان یک تجربه نوشیدنی لذت‌بخش و آرام‌بخش در نظر گرفت.</p> <p>در نهایت، قهوه ترک یک نوشیدنی خاص است که نه تنها در ترکیه، بلکه در بسیاری از کشورهای منطقه خاورمیانه و بالکان نیز محبوبیت دارد و به عنوان نمادی از مهمان‌نوازی و سنت‌های فرهنگی در نظر گرفته می‌شود.</p>
      `,
  },
  {
    slug: "americano",
    title: "آمریکانو",
    description:
      "آمریکانو یک نوشیدنی ساده و پرطرفدار بر پایه اسپرسو است که با آب گرم رقیق شده است.",
    image: "/images/blogs/americano.jpg",
    date: "13 آبان",
    author: "pedram_z4",
    authorImage: "/images/unknown.jpg",
    content: `
        <p>آمریکانو یکی از نوشیدنی‌های محبوب قهوه است که به سادگی از اسپرسو و آب گرم تهیه می‌شود. این نوشیدنی به دلیل طعم ملایم‌تر و کمتر تلخ نسبت به اسپرسو، طرفداران زیادی دارد.</p> <p>این نوشیدنی برای افرادی که به دنبال یک نوشیدنی قهوه‌ای هستند که نه آنقدر تلخ باشد و نه آنقدر رقیق، انتخاب مناسبی است. معمولاً آمریکانو به عنوان یک جایگزین سبک‌تر برای اسپرسو در نظر گرفته می‌شود.</p> <p>آمریکانو در ابتدا در زمان جنگ جهانی دوم به وجود آمد. سربازان آمریکایی در اروپا برای تطبیق با طعم قهوه‌‍های ایتالیایی، اسپرسو را با آب داغ رقیق می‌کردند و این نوشیدنی در میان مردم رواج پیدا کرد.</p> <p>اگرچه آمریکانو از نظر پایه مشابه اسپرسو است، اما به دلیل استفاده از آب بیشتر، طعمی ملایم‌تر و کمتر غلیظ دارد. این ویژگی باعث می‌شود که آمریکانو برای کسانی که به شدت به قهوه علاقه دارند، اما طعم قوی اسپرسو را نمی‌پسندند، ایده‌آل باشد.</p> <p>می‌توان آمریکانو را به شکل‌های مختلفی مانند گرم یا سرد سرو کرد. بسیاری از کافی‌شاپ‌ها برای سرو آمریکانو در تابستان از یخ استفاده می‌کنند تا یک نوشیدنی خنک و انرژی‌زا تهیه کنند.</p> <p>این نوشیدنی به دلیل داشتن کافئین کافی، می‌تواند به بیداری و تمرکز کمک کند. به ویژه برای افرادی که به دنبال نوشیدنی ساده و پرانرژی هستند، گزینه‌ای عالی به شمار می‌رود.</p> <p>آمریکانو طعم خالص قهوه را حفظ می‌کند، اما به دلیل رقیق‌تر بودن، آن را برای افرادی که به دنبال یک نوشیدنی قوی نیستند، جذاب می‌کند.</p> <p>در بسیاری از کافی‌شاپ‌ها، آمریکانو به همراه شیر یا شکر نیز سرو می‌شود. این کار به افراد این امکان را می‌دهد که نوشیدنی خود را مطابق با سلیقه خود تنظیم کنند.</p> <p>آمریکانو یک نوشیدنی انعطاف‌پذیر است که می‌توان آن را به صورت ساده یا با افزودن طعم‌دهنده‌ها مانند وانیل یا کارامل سرو کرد. به همین دلیل این نوشیدنی هم برای طرفداران قهوه و هم برای کسانی که به دنبال طعمی خاص هستند، گزینه‌ای عالی است.</p>
      `
  },
];

const Details = ({ blogname }) => {
  const article = articles.find(article => article.slug === blogname);

  if (!article) {
    return <div>مقاله‌ای با این نام یافت نشد.</div>;
  }

  return (
    <div className="text-zinc-700 dark:text-gray-100">
      <p className="text-md font-bold mx-auto text-center">{article.title}</p>
      <p className="text-3xl leading-8 lg:leading-6 text-center mt-6 mb-3">
        {article.description}
      </p>
      <div className="flex gap-2 text-gray-400 flex-row-reverse justify-center">
        <p>نویسنده</p>
        <img
          className="w-5 rounded-full object-cover block h-full"
          src={article.authorImage}
          alt={article.author}
        />
        <p>{article.author}</p>
      </div>

      <div className="relative mt-8">
        <div className="absolute top-3 right-3 py-1 px-2 bg-brown-100 font-semibold rounded-md text-center text-zinc-800">
          {article.date}
        </div>
        <img className="w-full" src={article.image} alt={article.title} />
      </div>

      <section dangerouslySetInnerHTML={{ __html: article.content }} />
    </div>
  );
};

export default Details;
