import Breadcrumb from "@/components/modules/breadcrumb/Breadcrumb";
import Footer from "@/components/modules/Footer/footer";
import Navbar from "@/components/modules/Navbar/Navbar";
import { authUser } from "@/utils/serverHelpers";
import { notFound } from "next/navigation";

const pagesContent = {
  "privacy-policy": {
    title: "حریم خصوصی",
    content:
      "قهوه طلایی ضمن احترامی که برای حریم شخصی کاربران قائل است، برای خرید، ثبت نظر یا استفاده از برخی امکانات وب سایت اطلاعاتی را از کاربران درخواست می‌کند تا بتواند خدماتی امن و مطمئن را به کاربران ارائه دهد. برای پردازش و ارسال سفارش، اطلاعاتی مانند آدرس، شماره تلفن و ایمیل مورد نیاز است و از آنجا که کلیه فعالیت‌های قهوه ست قانونی و مبتنی بر قوانین تجارت الکترونیک صورت می‌گیرد و طی فرایند خرید، فاکتور رسمی و بنا به درخواست مشتریان حقوقی گواهی ارزش افزوده صادر می‌شود، از این رو وارد کردن  اطلاعاتی مانند نام و کد ملی برای اشخاص حقیقی یا کد اقتصادی و شناسه ملی برای خریدهای سازمانی لازم است. همچنین آدرس  ایمیل  و تلفن‌هایی که مشتری در پروفایل خود ثبت می‌کند، تنها  آدرس ایمیل و تلفن‌های رسمی و مورد تایید مشتری است  و تمام مکاتبات  و پاسخ‌های شرکت از طریق آنها صورت می‌گیرد.مشتریان می‌توانند نام، آدرس و تلفن شخص دیگری را برای تحویل گرفتن سفارش وارد کنند و قهوه ست تنها برای ارسال همان سفارش، از این اطلاعات استفاده خواهد کرد.همچنین قهوه ست ممکن است برای ارتباط با مشتریان، بهینه سازی محتوای وب سایت و تحقیقات بازاریابی از برخی اطلاعات استفاده کند و برای اطلاع رسانی رویدادها  و اخبار، خدمات و سرویس‌های ویژه یا پروموشن‌ها، برای اعضای وب سایت ایمیل یا پیامک ارسال نماید. در صورتی که کاربران تمایل به دریافت اینگونه ایمیل و پیامک‌ها نداشته باشند، می‌توانند عضویت دریافت خبرنامه قهوه ست را در پروفایل خود لغو کنند قهوه ست ممکن است نقد و نظرهای ارسالی کاربران را در راستای رعایت  قوانین وب سایت ویرایش کند. همچنین اگر نظر یا پیام ارسال شده توسط کاربر، مشمول مصادیق محتوای مجرمانه باشد، قهوه ست می‌تواند از اطلاعات ثبت شده برای پیگیری قانونی استفاده کند.حفظ و نگهداری رمز عبور بر عهده کاربران است و برای جلوگیری از هرگونه سوء استفاده احتمالی، کاربران نباید آن را برای شخص دیگری فاش کنند. قهوه ست هویت شخصی کاربران را محرمانه می‌داند و اطلاعات شخصی آنان را به هیچ شخص یا سازمان دیگری منتقل نمی‌کند، مگر اینکه با حکم قانونی مجبور باشد در اختیار مراجع ذی‌صلاح قرار دهد. قهوه طلایی همانند سایر وب سایت‌ها از جمع آوری IP و کوکی‌ها استفاده می‌کند، اما پروتکل، سرور و لایه‌های امنیتی قهوه ست و روش‌های مناسب مدیریت داده‌ها اطلاعات کاربران را محافظت و از دسترسی‌های غیر قانونی جلوگیری می‌کند.قهوه ست برای حفاظت و نگهداری اطلاعات و حریم شخصی کاربران همه توان خود را به کار می‌گیرد و امیدوار است که تجربه‌ی خریدی امن، راحت و خوشایند را برای همه کاربران فراهم آورد.",
    content2:
      "در صورتی که تمایلی به دریافت ایمیل‌ها و خبرنامه های قهوه طلایی ندارید٬ می توانید بر روی کلمه لغو عضویت در انتهای صفحه ایمیل کلیک کنید.",
    content3:
      "در صورت وجود هرگونه سوال٬ لطفا با اطلاعات تماس زیر ارتباط برقرار کنید",
    content4: "تلفن تماس و فکس : 021-33814721",
  },
  "returns": {
    title: "عودت کالا",
    content:
      "ما در تلاش هستیم تا تجربه خریدی لذت‌بخش برای شما فراهم کنیم. با این حال، اگر محصول قهوه‌ای که دریافت کردید با انتظارات شما همخوانی نداشت، می‌توانید از سیاست عودت کالای ما استفاده کنید. ",
    content2:
      "1.مهلت عودت کالا: شما تا 7 روز کاری پس از دریافت محصول فرصت دارید آن را بازگردانید.",
    content3:
      "2.شرایط بازگشت: بسته‌بندی محصول باید سالم بوده و قهوه باز یا مصرف نشده باشد.",
    content4:
      "3.هزینه عودت: هزینه ارسال مجدد بر عهده مشتری خواهد بود، مگر آنکه خطا از جانب ما باشد.",
    content5:
      "پس از بررسی شرایط محصول، وجه شما طی 5 تا 7 روز کاری به حساب شما بازگردانده خواهد شد. ما همواره به کیفیت محصولات خود متعهد هستیم و در صورت بروز هرگونه مشکل، کنار شما خواهیم بود.",
  },

  "terms-of-use": {
    title: "شرایط استفاده",
    content:
      "به منظور بهره‌مندی از خدمات وب‌سایت، لطفاً موارد زیر را با دقت مطالعه کنید: استفاده از وب‌سایت به منزله پذیرش تمامی قوانین و شرایط آن است. تمامی اطلاعات وارد شده توسط کاربر، شامل نام، آدرس و اطلاعات تماس، باید صحیح و معتبر باشند. مسئولیت حفاظت از اطلاعات حساب کاربری، از جمله رمز عبور، بر عهده کاربر است. هرگونه سوءاستفاده از خدمات یا نقض قوانین وب‌سایت منجر به محدودیت یا قطع دسترسی خواهد شد. قیمت‌ها و موجودی محصولات ممکن است بدون اطلاع قبلی تغییر کنند. پرداخت‌های آنلاین از طریق درگاه‌های امن انجام می‌شوند و اطلاعات بانکی کاربران نزد وب‌سایت ذخیره نمی‌شود. محتوای سایت از جمله متن، تصاویر و طراحی‌ها متعلق به مجموعه است و هرگونه کپی‌برداری بدون مجوز قانونی ممنوع است. وب‌سایت تنها مسئولیت ارائه خدمات طبق قوانین تعریف‌شده را دارد و مسئولیتی بابت مشکلات ناشی از عوامل خارجی، نظیر اختلالات اینترنت، ندارد. در صورت بروز اختلاف، قوانین تجارت الکترونیک و حقوق مصرف‌کننده مرجع حل و فصل خواهند بود. کاربران موظف به مطالعه و پذیرش به‌روزرسانی‌های شرایط استفاده هستند که ممکن است در آینده اعمال شوند. هرگونه سفارش ثبت‌شده به منزله تأیید شرایط استفاده و قوانین وب‌سایت است. در صورت وجود سوال یا ابهام، کاربران می‌توانند با تیم پشتیبانی تماس بگیرند. رعایت این شرایط به حفظ کیفیت خدمات و ایجاد تجربه‌ای بهتر برای همه کاربران کمک می‌کند.",
    content2:
      "در صورت وجود هرگونه سوال٬ لطفا با اطلاعات تماس زیر ارتباط برقرار کنید",
    content3: "تلفن تماس و فکس : 021-33814721",
  },

  "place-order": {
    title: "ثبت سفارش",
    content:
      "برای ثبت سفارش، شما می‌توانید به دو روش حضوری و آنلاین اقدام کنید. در صورتی که تمایل به خرید حضوری دارید، می‌توانید به یکی از دو شعبه ما مراجعه کنید و از محصولات متنوع قهوه و تجهیزات موجود دیدن کنید. کارشناسان فروش در شعبه‌ها آماده‌اند تا شما را در انتخاب محصول مناسب راهنمایی کنند. اگر خرید آنلاین را ترجیح می‌دهید، کافیست وارد سایت ما شوید، محصول مورد نظر خود را از بین دسته‌بندی‌های مختلف قهوه و لوازم جانبی انتخاب کنید و پس از تکمیل مراحل سفارش، پرداخت آنلاین خود را از طریق درگاه‌های امن انجام دهید. تمامی اطلاعات پرداخت شما به صورت کاملاً رمزگذاری شده و امن خواهد بود. پس از ثبت سفارش آنلاین، شما می‌توانید وضعیت آن را از طریق پنل کاربری خود در سایت پیگیری کنید. همچنین تیم پشتیبانی آنلاین ما آماده پاسخگویی به هرگونه سوال و رفع ابهام در مورد محصولات یا سفارشات شماست. برای کسانی که به مشاوره برای انتخاب محصول نیاز دارند، کارشناسان ما از طریق چت آنلاین یا تماس تلفنی آماده ارائه راهنمایی هستند. علاوه بر این، برای مشتریانی که خرید حضوری انجام می‌دهند، تخفیف‌های ویژه‌ای در نظر گرفته شده است. هدف ما این است که تجربه خریدی راحت و لذت‌بخش را برای شما فراهم کنیم، چه از طریق شعبه‌های حضوری و چه به صورت آنلاین. تمامی محصولات ما از کیفیت بالایی برخوردار هستند و شما می‌توانید با خیالی راحت خرید خود را انجام دهید.",
    content2:
      "در صورت وجود هرگونه سوال٬ لطفا با اطلاعات تماس زیر ارتباط برقرار کنید",
    content3: "تلفن تماس و فکس : 021-33814721",
  },

  "careers": {
    title: "فرصت‌های شغلی",
    content:
      "گر شما علاقه‌مند به پیوستن به تیم ما هستید و می‌خواهید در یک محیط حرفه‌ای و خلاقانه فعالیت کنید، ما در حال حاضر به دنبال افراد با استعداد و پرانرژی می‌باشیم. فرصت‌های شغلی در بخش‌های مختلف شرکت از جمله فروش، پشتیبانی مشتری، بازاریابی، و مدیریت محتوای آنلاین برای افرادی که دارای تجربه و انگیزه لازم هستند، موجود است.",
    content2:
      "اگر شما در هر یک از این زمینه‌ها مهارت دارید یا علاقه‌مند به یادگیری و رشد در این حوزه‌ها هستید، خوشحال می‌شویم که رزومه خود را برای ما ارسال کنید. همکاری با ما فرصتی عالی برای پیشرفت حرفه‌ای و یادگیری در یک فضای کاری داینامیک و پویا خواهد بود.",
    content3:
      "برای ارسال رزومه، لطفاً آن را به آدرس ایمیل pedramdehghan1382@gmail.com ارسال کنید یا از طریق شماره تماس 09106163341 با ما تماس بگیرید. تیم منابع انسانی ما به تمامی درخواست‌ها پاسخ خواهد داد و با افراد واجد شرایط برای مراحل بعدی تماس خواهد گرفت. امیدواریم به زودی شاهد همکاری با شما باشیم.",
  },

  "warranties": {
    title: "ضمانت‌نامه‌ها",
    content:
      "ما در تلاش هستیم تا اعتماد شما را جلب کنیم و تجربه خریدی مطمئن و بدون دغدغه برای شما فراهم نماییم. به همین منظور، تمامی محصولات قهوه و تجهیزات ما با ضمانت‌نامه‌های معتبر عرضه می‌شوند. این ضمانت‌نامه‌ها شامل تعهد به کیفیت محصول، مدت زمان انقضا و شرایط استفاده از آن هستند. در صورت بروز هرگونه مشکل در محصول خریداری‌شده، شما می‌توانید از خدمات پس از فروش ما استفاده کرده و محصول را تعویض یا تعمیر کنید. تمامی ضمانت‌نامه‌ها به‌طور دقیق و شفاف در هنگام خرید همراه با محصول به شما ارائه می‌شود. در صورتی که محصول مورد نظر شما مشکل فنی یا خرابی داشته باشد، می‌توانید با تماس با تیم پشتیبانی ما، از شرایط استفاده از ضمانت‌نامه مطلع شوید و فرآیند تعویض یا بازگشت کالا را آغاز کنید. همچنین، برای محصولات خاص مانند تجهیزات قهوه‌سازی، ضمانت‌نامه‌های طولانی‌تری در نظر گرفته شده است که شامل تعمیرات و خدمات پس از فروش می‌شود. ما برای اطمینان از رضایت شما، این ضمانت‌ها را با شرایطی شفاف و بدون پیچیدگی طراحی کرده‌ایم تا در صورت بروز هرگونه مشکل، شما بتوانید با خیال راحت از خدمات ما استفاده کنید. هدف ما این است که به شما اطمینان دهیم که هر خریدی که از ما انجام می‌دهید، همراه با تضمین کیفیت و پشتیبانی است. برای کسب اطلاعات بیشتر درباره شرایط و مدت‌زمان ضمانت‌نامه‌ها، می‌توانید با تیم پشتیبانی ما تماس بگیرید.",
    content2:
      "در صورت وجود هرگونه سوال٬ لطفا با اطلاعات تماس زیر ارتباط برقرار کنید",
    content3: "تلفن تماس و فکس : 021-33814721",
  },
};

const Page = async ({ params }) => {
  const user = await authUser;

  const { id } = params;

  const pageData = pagesContent[id];

  if (!pageData) {
    notFound();
  }

  return (
    <>
      <Navbar isLogin={user ? true : false} />
      <Breadcrumb route={pageData.title} />
      <div className="p-6 py-20">
        <h1 className="text-zinc-800 dark:text-gray-200 text-2xl font-bold mb-4 w-[92%] md:w-[82%] lg:w-[72%] mx-auto leading-relaxed">
          {pageData.title}
        </h1>
        <p className="text-zinc-700 dark:text-gray-300 text-sm sm:text-base md:text-lg w-[90%] md:w-[80%] lg:w-[70%] mx-auto leading-9">
          {pageData.content}
        </p>
        <p className="text-zinc-700 dark:text-gray-300 text-sm sm:text-base md:text-lg w-[90%] md:w-[80%] lg:w-[70%] mx-auto leading-9 mt-4 md:mt-5">
          {pageData.content2}
        </p>
        <p className="text-zinc-700 dark:text-gray-300 text-sm sm:text-base md:text-lg w-[90%] md:w-[80%] lg:w-[70%] mx-auto leading-9 mt-4 md:mt-5">
          {pageData.content3}
        </p>
        <p className="text-zinc-700 dark:text-gray-300 text-sm sm:text-base md:text-lg w-[90%] md:w-[80%] lg:w-[70%] mx-auto leading-9 mt-4 md:mt-5 ">
          {pageData.content4}
        </p>
        <p className="text-zinc-700 dark:text-gray-300 text-sm sm:text-base md:text-lg w-[90%] md:w-[80%] lg:w-[70%] mx-auto leading-9 mt-4 md:mt-5 mb-14">
          {pageData.content5}
        </p>
      </div>
      <Footer />
    </>
  );
};

export default Page;
